app/controllers/blogs_controller.rb

	def index_all
		@blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"